# 课程数据
courses = [
    {'课程ID': 100001, '课程名称': "马克思主义", '课程类别': "必修"},
    {'课程ID': 100002, '课程名称': "工程伦理", '课程类别': "必修"},
    {'课程ID': 100091, '课程名称': "新时代中国特色社会主义理论实践", '课程类别': "选修"},
    {'课程ID': 100092, '课程名称': "形势与政策", '课程类别': "选修"},

    {'课程ID': 120001, '课程名称': "操作系统", '课程类别': "必修"},
    {'课程ID': 120002, '课程名称': "计算机图形学", '课程类别': "选修"},
    {'课程ID': 120003, '课程名称': "形式语言与自动机导论", '课程类别': "选修"},
    {'课程ID': 120004, '课程名称': "数据库原理与技术", '课程类别': "选修"},

    {'课程ID': 130001, '课程名称': "面向对象与Python编程", '课程类别': "选修"},
    {'课程ID': 130002, '课程名称': "面向对象与C++编程", '课程类别': "选修"},
    {'课程ID': 130003, '课程名称': "面向对象与Java编程", '课程类别': "选修"},
    {'课程ID': 130011, '课程名称': "Golang项目实战", '课程类别': "选修"},
    {'课程ID': 130012, '课程名称': "Rust项目实战", '课程类别': "选修"},
    {'课程ID': 130013, '课程名称': "ARMv8汇编与C语言实践", '课程类别': "选修"},

    {'课程ID': 150001, '课程名称': "离散数学", '课程类别': "必修"},
    {'课程ID': 150002, '课程名称': "学术英语与科技写作", '课程类别': "必修"},
    {'课程ID': 150003, '课程名称': "软件工程理论基础", '课程类别': "必修"},
    {'课程ID': 150004, '课程名称': "软件工程与计算Ⅲ", '课程类别': "必修"},
    {'课程ID': 150005, '课程名称': "软件体系架构", '课程类别': "必修"},
    {'课程ID': 150006, '课程名称': "大数据与人工智能Ⅱ", '课程类别': "选修"},
    {'课程ID': 150007, '课程名称': "大语言模型辅助软件工程", '课程类别': "选修"},
    {'课程ID': 150008, '课程名称': "高级算法", '课程类别': "选修"},
    {'课程ID': 150009, '课程名称': "软件需求工程", '课程类别': "选修"},
    {'课程ID': 150010, '课程名称': "移动应用开发（鸿蒙）", '课程类别': "选修"},
    {'课程ID': 150011, '课程名称': "移动应用开发（iOS）", '课程类别': "选修"},
    {'课程ID': 150012, '课程名称': "嵌入式应用开发", '课程类别': "选修"},
    {'课程ID': 150013, '课程名称': "高级人机交互技术", '课程类别': "选修"},
    {'课程ID': 150014, '课程名称': "软件测试原理与方法", '课程类别': "选修"},
    {'课程ID': 150015, '课程名称': "DevOps实践导论", '课程类别': "选修"},
    {'课程ID': 150016, '课程名称': "Linux系统基础", '课程类别': "选修"},
    {'课程ID': 150017, '课程名称': "自然语言处理基础", '课程类别': "选修"},

    {'课程ID': 900001, '课程名称': "体育（羽毛球）", '课程类别': "选修"},
    {'课程ID': 900002, '课程名称': "体育（足球）", '课程类别': "选修"},
    {'课程ID': 900003, '课程名称': "体育（瑜伽）", '课程类别': "选修"},
    {'课程ID': 900004, '课程名称': "体育（健美）", '课程类别': "选修"},
    {'课程ID': 900005, '课程名称': "体育（游泳）", '课程类别': "选修"},
    {'课程ID': 900006, '课程名称': "体育（台球）", '课程类别': "选修"},
]

# 用户选课列表
selected_courses = []


def query_courses(category=None):
    results = []
    for course in courses:
        if category and course['课程类别'] != category:
            continue
        results.append(course)
    return results


def query_selected_courses():
    return selected_courses


def select_course(course_id):
    for course in courses:
        if course['课程ID'] == course_id:
            if course not in selected_courses:
                selected_courses.append(course)
                return f"选课成功: {course['课程名称']}"
            else:
                return "选课失败，课程已经选过"
    return "选课失败，课程ID不存在"


def delete_course(course_id):
    for course in selected_courses:
        if course['课程ID'] == course_id:
            selected_courses.remove(course)
            return f"删除成功: {course['课程名称']}"
    return "删除失败，课程ID不存在或未选此课程"

